# 1.1
# 1) Установите Python и PyCharm
# 2) Напишите и запустите программу, которая выводит строку "Hello world!"
# 3) Напишите программу, которая на входе получает имя пользователя, сохраняет
# его в переменную user_name и выводит строку "Hello {user_name}!"
# 4) Напишите программу, которая на входе получает 2 числа, производит
# с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.
#
# 1.2 1) Напишите программу, чтобы вывести:
#
# *********
# *       *
# *       *
# *********
#
# 1.3. ** Напишите программу для нахождения цифр четырёхзначного числа.Число
# вводится при помощи методa input()
#
# Пример:
# Input: 3498
# Output:
# Тысячи - 3
# Сотни - 4
# Десятки - 9
# Единицы - 8
#
# 1.4. ** Напишите программу, которая считывает два целых числа a и b и
# выводит на экран квадрат суммы(a + b)^2 и сумму квадратов a^2 + b^2 этих чисел.
#
# Пример:
# Input: 3 2
#
# Output: Квадрат суммы 3 и 2 равен 25
# Сумма квадратов 3 и 2 равна 13

print("Hello, World!")